岗位负责人：马湘萍

高级数据建设工程师(前端)工作职责：

1、 负责君智企业研究平台和精准营销产品的前端架构设计和技术攻坚；

2、 负责可视化、UI组件等核心技术预研和实现；

3、 参与需求、设计和测试评审，有针对性提出合理的意见或建议；

4、 负责产品前端的用户体验优化；

2022-01
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.1-18参加泽清、婷婷主讲的《项目管理》《测试流程》的知识分享

1.参加项目管理流程的分享有助于我们在项目进行过程中达成共识，了解项目的周期和相关节点。
2.参加测试流程的分享有助于我们了解测试的方法和区别，对SIT, UAT引起重视。

君智1.3版本开发
1.君智1.3智能搜索-【关系图谱】模块开发和接口联调
    1.1 完成人物关系图开发和接口联调；
    1.2 完成股权穿透图-企业详情的接口联调；
    1.3 完成关系图谱模块的筛选弹框开发，图表工具栏添加，接口联调；
    1.4 完成关系图谱模块的自测和提测；
2.配合君智【问卷模块】上UAT预发布环境
    2.1 修复电子问卷、电话问卷禅道上的问题；
    2.2 修复问卷分析报告的的问题；
    2.3 完成简报版-数据源-问卷报告-图表生成图片功能开发；
3.君智1.3智能搜索-【公共媒体】线条连线
    3.1 对有映射关系的文章和对应的属性用虚线、实线的连线；
    3.2 连线的动画添加，并自测多种场景；
    3.3 完成公共媒体的自测和提测；
4.君智1.3【舆情监测】模块开发和接口联调
    4.1 配合后端准备舆情对接的前期数据
    4.2 舆情概览主体页面框架开发，公共模块抽取
    4.3 完成舆情概览、广告详情页面开发和接口联调
5.对君智项目代码的优化，公共代码的抽取
	
青海资产检测平台
1.完成中式报表预览开发导出excel的功能，引入插件xlsx
2.完成导出excel功能的自测和提测
3.配合测试解决中式报表问题

技术提升：
学习Vue源码解析第11-12章课程
总结：
1. 利他就是最好的利己，在配合的过程中多为他人考虑其实最大程度上是利于自己的工作推展。
2. 换一种思路去思考，也许会发现一些偶现问题可以用另外的方式解决。

展望：
自己就是自己的项目，严格要求自己就是严格要求项目的质量

/////////////////////////////////////////////////////////////////////////////



2022-02
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.websocket消息推送心跳监测方法学习
2.antv图形插件g6关系图谱API的学习

1.在君智项目中保持websocket连接，确保数据的时效性
2.在君智项目中【关系图谱】中使用，使企业、人物层级关系更加清晰

君智1.3版本开发
1.君智1.3【舆情监测】模块开发和接口联调、问题修复
    1.1 完成知识Pad数据源【舆情报告】图表生成图片，接口联调
    1.2 完成舆情监测websocket请求优化，切换tab重新连接websocket，token过期重新连接，保证websocket正常连接
    1.3 完成舆情监测模块配合测试修复问题，配合接口修改入参
2.君智1.3【智能搜索】关系图谱优化
	2.1 完成关系图谱的图表交互优化，线条交互修改，参考天眼查企业关系图表交互
	2.2 完成股权穿透图、关系图谱工具栏添加图片
	2.3 人物图片无法加载、人物图片跨域问题解决，添加人物节点默认样式
	2.4 图表的loading效果优化
3.君智UAT的功能自测，并修复相关问题，提出相关优化建议
4.君智1.3.1优化版需求开发、自测、问题修复
	4.1 【问卷设计】添加省市区、省市两种题型，接口联调
	4.2 【问卷设计】单选题、多选题添加图片上传，图片裁剪
	4.3 【问卷设计】分页栏批量删除，只删除分页，不删除问题
	4.3 【问卷设计】批量添加题目添加调研目的和调研对象筛选，同问卷模板
5.君智反馈问题修复：【测试问题反馈-20220224.xlsx】
6.对君智项目代码的优化，树形文件夹公共组件抽取

文档的输出
1.系统上线版本管理采用标签管理，版本发布之后，为代码打上标签，方便后期管理
2.输出标签管理说明、使用说明，规则说明文档

技术提升：
LeetCode简单算法学习
总结：
1. 完善一些边界性问题会使程序更加健壮
2. 程序中需要在每一个可能发生错误的地方捕获异常，这对错误的判断，错误的定位有很大的帮助，增加程序的稳定性

展望：
将自身的技术水平再往深度挖掘

/////////////////////////////////////////////////////////////////////////////

2022-03
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1.精准营销前期准备
2.可一键切换企业色
3.完成精准营销相关决策流节点开发，活动提升看板开发
4.完成精准营销产品当前BUG修复

预期成果
1.完成精准营销产品开发的前期准备：需求了解，原型评审，新分支创建，测试用例评审；
2.完成企业色调整，图片、图标和项目主调色根据企业色配置做区分，可一键切换企业色；
3.按时完成决策流预定执行节点、客户筛选节点、营销事件节点、A/B测试节点的前端开发和配合后端接口联调；
4.按时完成活动提升看板的前端开发和配合后端接口联调；
5.按时完成精准营销产品相关模块的自测，交叉自测和提测；
6.配合测试修复精准营销产品提测模块的问题；
7.配合产品对修改需求的调整，并提出优化建议；

成果说明
1.按照开发计划保质保量完成研发工作并按时提测；
2.及时修复问题，做到当天问题当天修复；
3.3月31号通过测试验收；

君智二期
行动计划 
1.根据最终用户使用后反馈，优化系统功能，主要包括:舆情监控、智能搜索、问卷调研等多个应用

预期成果
1、和产品、后端、测试、前端小组沟通确认问题修复内容，并按计划修复问题
2、对相关内容自测并配合测试修复

成果说明
1、及时修复用户反馈问题
2、降低影响范围

技术提升：bpmn-js决策流插件学习：常用方法，常用模块API学习，为今后精准营销项目中决策流插件的替换和更新迭代做准备

本月工作总结：
主要工作是完成精准营销系统的部分优化开发，并按时交付。
总结的问题：
从用户反馈问题可以更多的了解用户的需求和关注点，更容易理解需求的目的，并反思实现过程中哪些地方可以提升用户体验。
展望：
多思考、多使用，参考业内优秀的插件和他们实现的方式，在实际项目开发中取长补短。

/////////////////////////////////////////////////////////////////////////////


2022-04
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1.精准营销UI还原
2.完成决策流活动画布部分节点优化
3.完成呼叫中心节点的模版管理开发

预期成果
1、完成精准营销产品优化的前期准备：需求了解，原型评审，生成开发计划
2、按时完成决策流客户分群节点、客户筛选节点、营销事件节点、A/B测试节点、呼叫中心节点的优化
3、按时完成呼叫中心节点的模版管理界面开发和配合后端接口联调
4、按时完成精准营销产品相关优化模块的自测


成果说明
1、修复UI还原，使产品界面美观和规范
2、按照开发计划保质保量完成精准营销优化研发工作

君智二期
行动计划 
1、君智代码review，无用文件无用代码删除并优化相关代码
2、根据用户使用后反馈，优化系统功能，添加问卷版本号管理
3、配合君智用户反馈问题优化版上线
4、参加君智线下问卷需求评审，评估时间，生成开发计划，新分支创建

预期成果
1、使君智代码整洁，规范
2、按时完成问卷版本号管理，并对相关影响范围评估和修改，自测并交叉自测通过
3、按时提测系统优化的修改，并配合测试修改相关问题，配合UI还原设计
4、按计划启动君智线下问卷模块的开发：查看下载答卷相关模块开发
5、君智【数据监控】、【服务监控】页面nginx配置修改，修改步骤整理

成果说明
1、代码的review方便后期的维护和扩展
2、及时修复用户反馈问题
3、按计划实施君智线下问卷模块开发
4、nginx配置更新，为后期上线和维护做充分准备

技术提升：gRPC了解，学习前后端接口的标准和规范；antv-x6的API学习，为后期简报版的插件替换做准备。

本月工作总结：
主要工作是完成君智系统的部分优化开发，并按时交付；完成精准营销系统部分优化开发；启动君智线下问卷模块的开发；
总结的问题：
微信分享配置不同的分享方式会偶尔不生效，原因是因为微信分享规则修改了，我们也需要关注微信规则更新或者其他相关API的更新，并及时同步到项目，同步给用户。
展望：
熟练掌握标签序列化和反序列化解析规则

/////////////////////////////////////////////////////////////////////////////



2022-05
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1.完成精准营销呼叫中心模版：接口联调，自测和提测
2.修复精准营销产品相关优化模块第一轮第二轮测试问题
3.参加精准营销6月底上线需求评审

预期成果
1、按时完成精准营销产品相关优化模块的提测
2、按时完成精准营销产品相关优化模块的问题修复并清零
3、了解精准营销优化版需求，并制定开发计划

成果说明
1、按计划完成精准营销产品相关优化模块的自测，提测，问题修复，达到可上线状态
2、制定下一步精准营销开发计划，为后续开发做充分准备

君智二期
行动计划 
1、君智线下问卷富文本编辑器开发，新功能插件的引入
2、君智电子问卷分析：交叉分析，自定义查询页面开发和接口联调
3、君智线下问卷默认报告，添加观点，查看下载答卷，查看答卷详情，原文答卷页面开发和接口联调
4、参加君智线下问卷测试用例评审
5、君智线下问卷调研报告：列表，编辑，预览，历史版本，分享页面的开发和接口联调

预期成果
1、使富文本编辑器满足君智需求：文本编辑、图片编辑、列表编辑、标题编辑、高亮词功能，搜索词功能，下划线、中华线、居中、居左、居右功能、文字颜色、修改字体、关联问卷问题，关联答卷文本
2、完成电子问卷分析页面开发，完成线下问卷的部分功能开发，自测并交叉测试通过提测
3、完成线下问卷调研报告的开发，并按时提测
4、配合测试修改相关问题，配合UI还原设计

成果说明
1、公共组件的抽取，公共代码的抽取，方便后期维护
2、按照开发计划保质保量完成君智线下问卷模块研发工作
3、完成富文本编辑器开发，使插件功能符合君智需求
4、按计划实施君智提测模块，君智整体提测时间无延迟

技术提升：OnlyOffice文档编辑API学习，多人办公流程学习

本月工作总结：
主要工作是完成君智系统的线下问卷部分模块开发，并按时交付；完成精准营销系统部分优化提测，并及时修复问题；
总结的问题：
1. 富文本编辑器的关联文案借鉴了HTML标签的交叉嵌套，节点的开关和闭合规则来解决交叉文案的关联
2. 有想法就付诸行动，试过才知道合不合适
展望：
学习企业微信群活码API和规则，投入精准营销开发

/////////////////////////////////////////////////////////////////////////////



2022-06
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1、精准营销6月底上线版本需求了解，AIModeler需求评审，测试用例评审
2、精准营销开发前期准备工作
3、完成精准营销6月底上线版本开发

预期成果
1、按时完成精准营销产品六月底上线需求的时间评估，开发计划，代码合并，提测节点预估
2、按时完成【社交营销】模块的群活码、个人活码、欢迎语、企业微信节点、企业微信渠道的开发，联调，自测，提测
3、按时完成【AI Moderler】模块的AIModeler节点、AIModeler管理页面、AIModeler详情页、混淆矩阵开发，联调，自测，提测
4、按时完成【BI】模块的快捷创建客群、跳转营销页面自动创建节点、新建活动流程修改开发，联调，自测，提测
5、按时完成精准营销产品六月底上线块的问题修复并清零
6、按时完成精准营销产品六月底上线块的UI还原

成果说明
1、按计划完成精准营销产品六月底上线版本模块的开发，达到可上线状态
2、按时完成产品补充需求的开发，并优化相关代码和交互
3、抽取多个公共组件，提升开发效率，提升代码复用率
4、按计划实施精准营销提测模块，精准营销提测时间无延迟

君智二期
行动计划 
1、君智6月2号上线需求开发
2、参加君智舆情模块需求评审
3、配合测试完成君智线下问卷、调研报告问题修复
4、富文本框编辑器交互优化，提示文字汉化

预期成果
1、按时完成6月2号上线需求开发：默认报告单选题添加填空内容、下载电子问卷二维码、跳转逻辑选项名称同步
2、按时完成6月24号上线需求开发：调研报告，线下问卷原文答卷、交叉分析、自定义查询
3、按时完成君智6月24号上线版本的问题修复并清零
4、配合君智线下问卷和调研报告上UAT

成果说明
1、按时完成君智6月2号、6月24号上线版本开发，达到可上线状态
2、完成富文本编辑器交互优化，使插件功能符合君智需求

技术提升：AIModeler模型工作原理学习，应用场景学习；企业微信群活码建群、加群配置学习；

本月工作总结：
主要工作是完成精准营销系统6月底上线版本开发，并及时修复问题；完成君智系统的调研报告模块开发，并按时交付；
总结的问题：
对于使用第三方数据模块或者应用，需要了解工作的内部原理，方便后期维护
展望：
富文本框插件补充开发文档，方便后期维护

/////////////////////////////////////////////////////////////////////////////


2022-07
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1、配合精准营销六月底开发版本上线
2、精准营销七月份需求了解，前期准备工作
3、进入精准营销需求开发工作

预期成果
1、配合六月底开发版本上线，nginx配置修改，代码加上标签版本管理
2、按时完成【综合配置】【事件管理】模块的开发，联调，自测
3、按时完成【开始节点】【目标客群节点】【Offer节点】模块的开发，联调，自测
4、按时完成【客户视图-新建客群】模块的开发，联调，自测
5、按时完成精准营销节点的梳理，公共规则组件开发

成果说明
1、按计划实施精准营销产品七月份需求模块的开发，客户规则筛选组件的开发
2、配合产品完成补充需求的开发，并优化相关代码和交互
3、抽取规则筛选公共组件，统一筛选规则，提升开发效率，提升代码复用率

君智二期
行动计划 
1、君智【舆情模块】部分功能开发，舆情图表下钻功能开发
2、君智UAT反馈问题修复，配合版本上线，规范代码版本管理
3、公共模块BI在多个项目代码兼容


预期成果
1、按时完成舆情模块多张图表下钻功能的开发，并自测通过，配合测试验证
2、按时完成7月19号上线需求开发，完成相关的交互优化
3、完成君智项目角色权限的需求了解，权限梳理
4、完成君智UAT反馈的0725问题时间评估，制定开发计划
5、富文本框编辑器小屏幕兼容优化，交互优化，性能优化

成果说明
1、配合完成君智7月19号舆情模块上线版本开发，达到可上线状态
2、富文本编辑器迭代优化，使插件功能符合君智需求
3、制定下一步君智问题修复计划，为后续开发做充分准备

技术提升：飞书文本编辑器交互学习，部分功能同步到君智项目富文本框编辑器

本月工作总结：
主要工作是按计划开始精准营销系统7、8月份版本开发；配合完成君智系统的舆情模块图表下钻开发，配合修复君智UAT客户反馈优化；
总结的问题：
明确需求才能顺利实施开发计划，只要发现有不明确不合理的地方都需要立即确认，再进入开发。
展望：
遇到问题多思考，给出专业的建议

/////////////////////////////////////////////////////////////////////////////



2022-08
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1、精准营销剩余3个节点需求开发工作
2、精准营销客户分层规则开发

预期成果
1、按时完成【目标客群】客群规则预览界面开发
2、按时完成【成功标准节点】【响应标准节点】模块的开发，联调，自测
3、按时完成【客户分层规则】模块的开发，联调，自测
4、进入【裂变节点】的页面开发，数据模型定义，添加相关验证

成果说明
1、按计划实施精准营销产品剩余节点的开发
2、完成公共组件【客户规则筛选组件】预览的兼容
3、完成客户分层规则开发，套用公共规则组件

君智二期
行动计划 
1、君智【0804版本】、【0818版本】、【0901版本】上线版本需求的开发
2、君智【0804版本】、【0818版本】上线跟进
3、君智【7_25反馈问题】、【文件补录】对接飞书、【调研访谈】、【热点事件】的原型需求评审以及时间评估
4、【君智图表主题色】影响页面梳理，时间评估


预期成果
1、配合【0804版本】号上线版本的跟进
2、按时完成【0818版本】上线版本部分需求开发，完成相关的交互修改，自测
   2.1、【默认报告】新增问卷版本、问卷问题、问卷调研信息筛选条件
   2.2、【电话问卷、线下调研】的问题默认为改为非必填（不勾选）
   2.3、【君智图表主题色】影响页面的修改和兼容
   2.4、【音频播放】控件交互方式修改：改为后端直接提供url的方式，只需在url上加token
   2.5、【默认报告】【查看下载答卷】新增动态字段筛选条件
3、按时完成【0901版本】上线版本部分需求开发，完成相关的交互修改，自测
   3.1、【默认报告】线下调研问卷默认报告题目新增追加问题分析功能
   3.2、【调研报告】【简报版】数据源的追加问题图表生成图片
   3.3、【问卷设计】新增题目或选项时需自动跳转到该题目或该选项的位置
   3.4、【问卷编辑】题目编辑交互变更
   3.5、【问卷设置】电话问卷、线下问卷发布工作流程修改
   3.6、【线下调研问卷】问卷作答页面填空题、追加问题文本框没有自适应高度
   3.7、【调研报告】自动保存交互修改、标题保存交互修改
4、完成【调研访谈】【热点事件】【文件补录】对接飞书时间评估，制定开发计划
5、自觉完成每周四上线版本的交叉自测

成果说明
1、按时完成君智【0804版本】、【0818版本】、【0901版本】上线需求开发，达到可上线状态
2、君智新需求的时间评估，制定开发计划，为后续开发做充分准备
3、逐步进行代码的CodeReview工作，使代码整洁干净，消除隐藏隐患

技术提升：飞书文件管理API学习；音频转码学习；

本月工作总结：
主要工作是按计划开发君智系统的每周四版本上线版本，参加君智新需求的需求评审和时间评估；配合完成精准营销系统剩余节点和客户分层开发；
总结的问题：
个别音频m4a后缀的在谷歌浏览器不能播放，找问题的过程中顺便了解了音频的相关历史，标准编码，转码的相关知识。
展望：
追求代码质量是一个成长的过程

/////////////////////////////////////////////////////////////////////////////


2022-09
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1、精准营销【吴晓波频道】需求的开始节点开发

预期成果
1、将精准营销4.1版本的开始节点的代码合并过来，使用精准营销4.1版本的开始节点的预定执行

成果说明
1、完成开始节点的代码迁移，支持【吴晓波频道】需求的决策流开发

君智二期
行动计划 
1、君智【0901版本】上线版本需求的提测，上线跟进
2、君智【0908版本】、【0922版本调研访谈】需求的开发，自测，提测，上线跟进
3、内部君智系统添加【滑块题型】需求的开发，自测，提测，上线跟进
4、进入君智【热点事件】需求的开发


预期成果
1、配合【0901版本】的问题修复和上线的跟进
2、按时完成【0908版本】上线版本部分需求开发，完成相关的交互修改，自测
   2.1、【问卷编辑】编辑问卷问题时，用户无需先删除默认标题，再输入自己的问题
   2.2、【电子问卷、电话问卷、线下调研】三大问卷类型拆分
   2.3、【默认报告】词云下载图片颜色修改，观点和追加问题的词云放大和缩小不起作用修复
   2.4、【文件上传】修改文件名称后显示异常修复
   2.5、【电子问卷、电话调研、线下调研问卷列表】复制增加指定调研方式
   2.6、【问卷编辑】问卷发布后再次编辑可以调整问题顺序
   2.7、【单选题、矩阵单选、量表题、矩阵量表】支持取消选择
3、按时完成【0922版本调研访谈】上线版本部分需求开发，完成相关的交互修改，自测
   3.1、【组合问卷】新建问卷、编辑问卷、预览问卷、电脑手机外观、组合问卷发布的开发
   3.2、【组合问卷】默认报告、查看下载答卷的开发
   3.3、【访谈记录】线下问卷作答页增加访谈记录，保存和修改接口联调
   3.4、【访谈记录】可伸缩模块，关联单份问卷问题，关联组合问卷问题，关联原文开发
   3.5、【组合问卷作答】再次编辑原文作答，没有回显之前已作答的内容修复
   3.6、【组合问卷作答】新增音频后导致重复新增问题修复
4、按时完成君智系统添加【滑块题型】需求的开发，自测，提测，上线跟进
5、自觉完成每个上线版本的交叉自测
6、进入【热点事件】需求开发，和接口对接数据模型

成果说明
1、按时完成君智【0901版本】、【0908版本】、【0922版本】、【滑块题型】上线需求开发，达到可上线状态
2、对接【热点事件】数据模型，为后续开发做充分准备
3、积极配合测试进行UAT验证，快速修复问题

技术提升：Vue3语法学习；

本月工作总结：
主要工作是按计划开发君智系统的周四版本上线版本，支持君智新需求的开发和上线；配合完成精准营销系统【吴晓波频道】需求的开发；
总结的问题：
有些时候需要别人的督促才会意识到问题，在体验产品上多听听别人的建议
展望：
熟练使用Vue3开发语法和模式

/////////////////////////////////////////////////////////////////////////////

2022-10
/////////////////////////////////////////////////////////////////////////////

君智二期
行动计划 
1、君智【热点事件】需求的开发，自测，提测，上线跟进
2、君智【1021版本】、【1028版本】需求的开发，自测，提测，上线跟进

预期成果
1、配合【1021版本】的问题修复和上线的跟进
  1.1、【问卷默认报告】默认报告选项列表滚动条去掉，自适应高度修复
  1.2、【问卷编辑】删除题目后题目的高度没更新，批量删除多层弹框的遮罩层修复
  1.3、【调研报告】数据源的表格样式问题调整
  1.4、【线下问卷】调研访谈高度偶现叠加问题修复
  1.5、【主题色】饼状图、柱状图主题颜色修改
2、按时完成【热点事件】上线版本部分需求开发，联调，提测，上线跟进
   2.1、【热搜事件列表】多个筛选条件、关注、不感兴趣、合并事件弹框、热度上升下降提示开发
   2.2、【事件预警】新增预警、编辑预警、预警消息通知，预警消息列表开发
   2.3、【热点事件信息列表】多个筛选条件、查看原文、关注事件开发
   2.4、【关注事件列表】多个筛选条件、热度上升下降提示、删除、查看事件报表
   2.5、【关注事件详情】整体概况6个图表、评论分析4个图表、微博画像4个图表、图表的下钻查看信息列表开发 
   2.6、【关注事件详情】配合UI修改图表样式
3、按时完成【1028版本】上线版本部分需求开发，提测，上线跟进
   3.1、【问卷编辑】计算公式的弹框开发，接口联调
   3.2、【问卷答卷】计算公式答卷逻辑处理
   3.3、【消息列表】配合后端修改传参
   3.4、【信息列表】信息列表处的评论应展示字段修改、文章标题过长UI修复
4、参加【热点事件】测试用例评审
5、完成每个上线版本的交叉自测

成果说明
1、按时完成君智【1021版本】、【1028版本】、【热点事件】上线需求开发，达到可上线状态
2、积极配合测试进行UAT验证，快速修复问题
3、配合UI对整体图表样式调整

技术提升：Vue3、tsx语法学习；

本月工作总结：
主要工作是按计划开发君智系统的周五版本上线版本，支持君智新需求的开发和上线
总结的问题：
了解项目构建流程，新的构建工具用法了解
展望：
熟练使用tsx开发页面

/////////////////////////////////////////////////////////////////////////////


2022-11
/////////////////////////////////////////////////////////////////////////////

君智二期
行动计划 
1、君智UAT问题修复，优化需求开发
2、君智【词云分析】原型评审，需求了解，时间评估，需求开发，自测，提测
3、君智【问卷调研问题反馈列表1215】【问卷调研问题反馈列表1223】原型评审、需求了解、时间评估
4、君智【问卷调研问题反馈列表1215】需求的开发，自测，部分需求提测

预期成果
1、配合君智UAT问题修复，优化需求开发
  1.1、【事件详情】传播路径图表画布大小调整，可上下滚动画布（新需求）
  1.2、【事件详情】评论总数图表下钻数据带‘评论’条件筛选
  1.3、【热点信息列表、热点详情图表】下钻数据的情感默认加上全部
  1.4、【事件详情】 热点信息默认时间改成三个月（新需求）
  1.5、【问卷设计】问卷标题变更为可输入特殊字符、不可输入英文单引号和正斜杠（新需求）
  1.6、【情感分析】切换渠道没有调用接口修复
  1.7、【问卷设计】从其他题型切换到多选题后，最少选几项和最多选几项没有填充内容修复
  1.8、【logo替换】君智启用新logo，系统中君智logo需要替换（新需求）
  1.9、【问卷列表】从发送问卷页面返回到问卷列表页面后，当前文件夹显示的问卷有误修复
2、按时完成【词云分析】部分需求开发，联调，部分需求提测
   2.1、【词云图表】设置字体，设置旋转角度，设置颜色主题，设置鼠标经过提示，点击图表下钻，图表大小修改
   2.2、【词云图表】设置词云图片的形状、获取缩略图、下载图片
   2.3、【词云图表】词云图表为可切换编辑状态，选中图表中的关键词可以放大、缩小、删除
   2.4、【词云设计】【关键词列表】关键词数量较多时，会拉长词云图表画布修复
   2.5、【词云设计】关键词超过一定长度后，在词云图表中展示省略号
3、进入【问卷调研问题反馈列表1215】上线版本部分需求开发，自测、提测
   3.1、【网页采集】加‘大众点评’渠道、支持省份城市的多选
   3.2、【查看下载答卷】答卷列表不同分辨率下高度自适应
   3.3、【问卷编辑】题目“问题”修改为标题、题目“完成编辑”修改为保存
   3.4、【问卷编辑】问卷发布后再次编辑显示“在此题之后插入新题”按钮
   3.5、【调研报告】问卷数据源-图表数据懒加载
   3.6、【默认报告】添加观点-观点的原文搜索和观点搜索做区分
   3.7、【默认报告】添加观点-筛选答案增加全选复选框、预设观点支持删除
   3.7、【交叉分析】统计图中百分比是0的值不用显示
4、参加【词云分析】【问卷调研问题反馈列表1215】【问卷调研问题反馈列表1223】原型评审
5、Antv-G2Plot图表库引入，升级君智项目词云图表、漏斗图表

成果说明
1、积极配合测试进行UAT验证，快速修复问题
2、按计划实施君智【词云分析】、【问卷调研问题反馈列表1215】上线需求开发和接口联调
3、配合UI对词云、漏斗图表样式调整
4、升级词云组件，贴合君智最新词云交互

技术提升：Antv-G2、Antv-G2Plot图表库语法学习；

本月工作总结：
主要工作是按计划开发君智系统的【词云分析】【问卷调研问题反馈列表1215】版本，支持君智新需求的开发，配合测试进行UAT验证
总结的问题：
Canvas画布的弧度路径绘制和Svg的弧度路径绘制有区别，但也有相似之处，知晓原理计算方式，就可按照参数绘制出预期的图形和图案。
展望：
熟练掌握Antv-g2plot开发图表，以便后期的BI图图表工具迭代升级
/////////////////////////////////////////////////////////////////////////////

2022-12
/////////////////////////////////////////////////////////////////////////////

君智二期
行动计划 
1、【君智1208版本】需求的开发、上线
2、君智【问卷调研问题反馈列表1215】剩余需求的开发，自测，需求提测、上线
3、君智【问卷调研问题反馈列表1223】需求的开发，自测，需求提测、上线
4、君智【词云分析】部分问题修复、上线
5、君智【预测预判】原型评审、需求开发

预期成果
1、【君智1208版本】开发、上线
   1.1、【网页采集】添加大众点评需求独立上线，拆分代码
   1.2、【观点图表】默认选中‘隐藏空/跳过的答卷’
2、【问卷调研问题反馈列表1215】上线版本剩余需求开发，自测、提测、上线
   2.1、【观点弹框】答卷列表筛选条件“答案文本修改为复选框”，增加全选
   2.2、【观点弹框】预设观点支持删除
   2.3、【交叉分析】统计图中百分比是0的不显示
   2.4、【问卷编辑】标题和提示文本框内容超过后自适应高度
   2.5、【默认报告】大数据量首屏加载速度提升，分批加载
   2.6、【问卷发布】新增题目版本
   2.7、【交叉分析】填空题有做观点统计的，该观点统计可放入交叉分析中分析
   2.7、【默认报告】将词云设置功能（编辑颜色、字体）添加在问卷自定义样式中
   2.8、【舆情信息】下钻图表数据配合后端修改
   2.9、【默认报告】【查看下载答卷】页面全局筛选条件修改
3、【词云分析】修复8个禅道问题、上线
4、【问卷调研问题反馈列表1223】需求的开发，自测，需求提测、上线
   4.1、【电话组合问卷】的添加
   4.2、【情感分析】高频词根据所选情感倾向返回正确的情感倾向的关键词 
   4.4、【调研统计】页面挪到电话发送页面，且放开权限控制
   4.5、【默认报告】柱状图、条形图、堆叠柱状图、堆叠条形图、折线图下载图片不全
5、【预测预判】原型评审、进入需求开发

成果说明
1、默认报告针对特定大数据量首屏加载速度提升8倍
2、按计划实施君智【君智1208版本】、【词云分析】、【问卷调研问题反馈列表1215】、【问卷调研问题反馈列表1223】上线需求开发和接口联调
3、配合君智各个版本上UAT，积极修复UAT问题
4、按计划实施君智预测预判需求开发

精准营销产品版本开发
行动计划
1、精准营销【中行权限】需求了解，需求开发，自测，提测

预期成果
1、按时完成精准营销【中行权限】需求开发、自测、提测 
  1.1、【角色管理】内容权限修改
  1.2、【营销活动】开始节点活动策划机构、活动策划人员权限范围修改
  1.3、【营销活动】AI模型节点预测目标概率修改
  1.4、【综合配置】新增【行级权限控制字段】
  1.5、【数据权限】修改后，关于树形部门管理结构的影响修复
2、配合测试修复已提测需求的问题修复
3、配合【中行权限】需求上演示环境

成果说明
1、完成【中行权限】所有新增修改需求的开发，达到可上线状态
2、积极配合修复演示环境问题，确保演示环境运行正常


技术提升：FusionCharts图表配置语法学习；

本月工作总结：
主要工作是按计划开发君智系统的【1208版本】【词云分析】【问卷调研问题反馈列表1215】【问卷调研问题反馈列表1223】版本，配合测试进行UAT验证；按计划完成精准营销【中行权限】需求的开发，配合上演示环境
总结的问题：
当暴露出的问题互相矛盾时，取最优解
展望：
继续保持对工作的热情
/////////////////////////////////////////////////////////////////////////////






