君智一期、君智优化版：
1. 按时完成君智一期问卷设计、问卷逻辑跳转、问卷预览公共组件、复制问卷页面的开发和接口联调。
2. 按时完成君智优化版采集模版任务管理模块、数据补录模块页面的开发和接口联调。
3. 配合产品完成修改需求的开发和产品优化开发。
4. 按时完成问卷模块的自测，交叉测试，提测。
5. 配合测试完成已提测模块的问题修复。

1. 主动参加组内人员代码的review，并给出优化建议。
2. 主动完成组内其他成员负责模块的接口联调、交叉测试、收尾工作，确保提测无阻塞流程问题。
3. 优化多个词云图表页面的加载速度，渲染速度提升2倍。


君智二期：
1. 按时完成君智1.2知识PAD页面、数据补录、知识图谱搜索页面、分享流程开发和配合后端接口联调。
2. 按时完成君智1.3问卷设计改版-问卷编辑、问卷预览、问卷答题、默认报告、电话调研统计、查看下载答卷、采集模版模块、关系图谱部分的开发和配合后端接口联调。
3. 配合后端君智1.2版上预发布环境。
5. 持续对公共组件的提取，合并代码的兼容自测。
6. 主动完成君智问卷提交的交互优化，定位题目，给出友好提示。
7. 君智企业色修改：全局配色文件添加，批量修改君智样式。

1. 参与产品需求的讨论，对一些交互提出优化建议。
2. 完成问卷设计、问卷分析整个流程的自测、交叉测试、按时提测。
2. 对知识PAD插件的交互进行优化：可裁剪图片，复制粘贴图片，方便用户的操作。
3. 对知识PAD流程图加入虚拟滚动条，其他交互参考xmind优化，提升用户体验。
4. 企业色统一文件修改，方便后期修改主题。

中式报表二期：
1. 完成报表二期优化功能点的需求讨论、时间评估、版本迭代规划、开发流程梳理、流程图输出。
2. 完成返回按钮交互优化；单元格过滤功能；报表预警功能；单元格支持函数公式计算；单元格插入数据集弹框改版；拖拽数据集字段功能的开发和接口联调。
3. 完成所有功能按照测试用例进行全范围的自测，并配合测试修复问题。
6. 按时交付给风控同事，并配合创建报表的操作解答。

1. 本次迭代共添加了10个功能，其中个人完成了6个。
2. 主动将中式报表的常见的，常反馈的用户体验优化了15个。
3. 主动完成中式报表预览接口代码的优化，大量数据加载速度的提升，比优化前提升了5倍。
4. 主动将中式报表已开发的第一、二版的代码、插件bug、对用户体验进行了代码的重构和优化，方便后期的维护。

精准营销三期：
1. 按时完成报表平台的仪表板、个人画像的统一风格UI样式修改。 
2. 按时完成决策流新增6个节点、2个修改节点的开发和接口联调。
3. 配合后端在不同项目添加‘定时任务’管理界面。

1. 主动将精准营销3期所有需求进行交叉测试，并向产品、前端同事提出相关优化建议。
2. 完成线上部署包准备，部署文档整理，上线部署。
3. 主动了解组内同事负责的模块，有助于掌握项目整体的开发思路，并能快速定位问题。

飞算驾驶舱改版
1. 定期跟进飞算驾驶舱数据的正确性，并反馈给相关的数仓组同事。
2. 独立完成飞算驾驶舱的改版：登陆改版、视频修改、综合管理的新闻修改、添加讲解图片、体验优化、加密方式升级。

1. 完成展厅视频加载、3D模型加载优化和调试，使首次进入页面更加流畅，减少卡顿现象。
2. 加密方式的升级使各个项目的加密方式统一，方便后期的维护和升级。


项目部署：
1. 出差华夏进行精准营销、华夏驾驶舱源码部署。
2. 出差华夏交付最新源代码，给华夏相关交接人员讲解项目的启动，源码的开发流程。
3. 出差青海银行：部署监测平台的前端、输出最新的部署文档、配合青海银行同事验收。
4. 出差青海银行：讲解监测平台的需求评审、讲解监测平台的使用。
5. 远程解答青海同事使用监测平台时遇到的问题，并跟进后续问题的解决。

1. 主动完成监测平台文档的编写，降低用户的使用的门槛，用我们的专业知识为他们解答。
2. 跨部门沟通、协作提高了自身的沟通能力，专业能力。

文档的输出：
1. 输出青海银行资产监测平台的部署文档，运维文档，常见问题文档，为监测平台的部署做好准备。
1. 输出青海资产检测平台系统《管理中心用户操作文档》的整理，发给机构组同事。
2. 主动完成《中式报表的使用手册》的编写，并持续更新。
3. 对前端运维文档的补充和修改，并记录常见问题和解决方案。
4. 持续更新前端项目中公共模块、公共混入的技术文档。

1. 输出前端部署文档，部署过程遇到的问题和解决方法，并分享给组内同事，同步到公司内部部署文档，积累后续部署经验。
2. 对运维文档的补充和更新，积累运维经验，有助于后续规避类似问题。
3. 对内部项目公共模块文档对补充有助于公共模块的维护。


专业能力：
1. 完成到华夏银行和青海银行出差，负责项目的部署、需求讲解、使用手册讲解，解答相关问题的任务。
2. 按时提测相关开发模块，并进行多次自测和组内成员交叉测试，确保提测后无阻塞流程问题。
3. 主动完成中式报表XSpreadSheet插件全部转成TypeScript文件，提升代码的健壮性。
4. 配合培梁进行新插件的引入：腾讯地图、D3图形处理工具的引入、antv-g6图形可视化引擎引入；参考挂载JS的方式引入，不影响其他页面的首屏加载。
5. 配合培梁将前端依赖包整体升级，对开发环境、测试环境jenkins依赖包升级更新，更新后并验证通过。升级有助于规避隐藏漏洞，提升代码的安全性；提升开发效率。
6. 主动完成相关的公共组件开发：表格列表、知识PAD脑图、图表生成图片、问卷预览等，减少代码的冗余。

向心力
1. 主动配合产品、测试、后端、UI进行需求点的讨论，并提出相关优化建议。
2. 按照代码规范主动对自身代码和组内同事的代码进行review，学习优秀的思维，指出错误写法，给出优化建议。
3. 参照统一规范编写对外提供的前端运维文档、常见问题文档、前端部署文档、项目使用手册，并反复检查和持续更新，反复斟酌措辞，尽量写出简单易用的文档说明，并统一公司名称统一口径。
4. 项目提测前，主动完成组内其他成员负责模块的交叉测试、收尾工作，确保提测无阻塞流程问题。
5. 积极参加公司举办的运动，经常跑步锻炼身体，劳逸结合。

收获与成长：
1. 今年参加了李总和张志峰分享的【数据中台建设】、【机器学习介绍】的分享，对数据中台的建设和机器学习原理算法有初步的认识，了解大数据发展方向；
2. 参加了黄锦平、王培梁主讲的【全球架构师峰会】的知识分享对服务端的多种运行模式有所了解，对新技术，前端技术的发展方向有新的理解；
3. 自主学习了canvas绘制图片、3D效果绘制模型、windows搭建wasm、rust、vscode开发环境、腾讯地图API学习、D3的API学习、antv图形可视化引擎API学习、书本《重构第二版》、Vue源码解析课程，在提升技术知识的过程中，也让我有更多的思考；
4. 去青海银行部署是一个很好的机会，







