
君智二期：
1. 按时完成君智1.3【舆情监测】、智能搜索-【公共媒体】线条、智能搜索-【关系图谱】模块开发和接口联调
3. 根据用户使用后反馈，优化系统功能，添加问卷版本号管理
5. 1、君智线下问卷富文本编辑器开发，新功能插件的引入
6. 2、君智电子问卷分析：交叉分析，自定义查询页面开发和接口联调
7. 3、君智线下问卷默认报告，添加观点，查看下载答卷，查看答卷详情，原文答卷页面开发和接口联调
5、君智线下问卷调研报告：列表，编辑，预览，历史版本，分享页面的开发和接口联调
按时完成6月2号上线需求开发：默认报告单选题添加填空内容、下载电子问卷二维码、跳转逻辑选项名称同步
2、按时完成6月24号上线需求开发：调研报告，线下问卷原文答卷、交叉分析、自定义查询

1. 参与产品需求的讨论，对一些交互提出优化建议。
2. 对君智项目代码的优化，公共代码的抽取
2. 3、完成富文本编辑器开发，使插件功能符合君智需求
3. 
4. 

青海资产检测平台
1.完成中式报表预览开发导出excel的功能，引入插件xlsx
2.完成导出excel功能的自测和提测
3.配合测试解决中式报表问题

精准营销产品版本开发
1. 完成企业色调整，图片、图标和项目主调色根据企业色配置做区分，可一键切换企业色； 
2. 按时完成决策流预定执行节点、客户筛选节点、营销事件节点、A / B测试节点的前端开发和配合后端接口联调
3. 按时完成决策流客户分群节点、客户筛选节点、营销事件节点、A/B测试节点、呼叫中心节点的优化
4. 按时完成活动提升看板的前端开发和配合后端接口联调；
5.按时完成精准营销产品相关模块的自测，交叉自测和提测；
6.配合测试修复精准营销产品提测模块的问题；
7.完成精准营销呼叫中心模版：接口联调，自测和提测
1、【社交营销】模块【AI Moderler】模块、【BI】模块的快捷创建客群

1. 按照开发计划保质保量完成研发工作并按时提测；
2. 3、抽取多个公共组件，提升开发效率，提升代码复用率
3. 4、按计划实施精准营销提测模块，精准营销提测时间无延迟

飞算驾驶舱改版
1. 定期跟进飞算驾驶舱数据的正确性，并反馈给相关的数仓组同事。
2. 独立完成飞算驾驶舱的改版：登陆改版、视频修改、综合管理的新闻修改、添加讲解图片、体验优化、加密方式升级。

1. 完成展厅视频加载、3D模型加载优化和调试，使首次进入页面更加流畅，减少卡顿现象。
2. 加密方式的升级使各个项目的加密方式统一，方便后期的维护和升级。


文档的输出：
1. 系统上线版本管理采用标签管理，版本发布之后，为代码打上标签，方便后期管理
1. 输出标签管理说明、使用说明，规则说明文档
2. nginx配置更新，为后期上线和维护做充分准备
3. 
4. 

1. 
2. 
3. 


专业能力：
1. 完成到华夏银行和青海银行出差，负责项目的部署、需求讲解、使用手册讲解，解答相关问题的任务。
2. 按时提测相关开发模块，并进行多次自测和组内成员交叉测试，确保提测后无阻塞流程问题。
3. 主动完成中式报表XSpreadSheet插件全部转成TypeScript文件，提升代码的健壮性。
4. 配合培梁进行新插件的引入：腾讯地图、D3图形处理工具的引入、antv-g6图形可视化引擎引入；参考挂载JS的方式引入，不影响其他页面的首屏加载。
5. 配合培梁将前端依赖包整体升级，对开发环境、测试环境jenkins依赖包升级更新，更新后并验证通过。升级有助于规避隐藏漏洞，提升代码的安全性；提升开发效率。
6. 主动完成相关的公共组件开发：表格列表、知识PAD脑图、图表生成图片、问卷预览等，减少代码的冗余。

向心力
1. 主动配合产品、测试、后端、UI进行需求点的讨论，并提出相关优化建议。
2. 按照代码规范主动对自身代码和组内同事的代码进行review，学习优秀的思维，指出错误写法，给出优化建议。
3. 参照统一规范编写对外提供的前端运维文档、常见问题文档、前端部署文档、项目使用手册，并反复检查和持续更新，反复斟酌措辞，尽量写出简单易用的文档说明，并统一公司名称统一口径。
4. 项目提测前，主动完成组内其他成员负责模块的交叉测试、收尾工作，确保提测无阻塞流程问题。
5. 积极参加公司举办的运动，经常跑步锻炼身体，劳逸结合。

收获与成长：
1. 今年参加了李总和张志峰分享的【数据中台建设】、【机器学习介绍】的分享，对数据中台的建设和机器学习原理算法有初步的认识，了解大数据发展方向；
2. 参加了黄锦平、王培梁主讲的【全球架构师峰会】的知识分享对服务端的多种运行模式有所了解，对新技术，前端技术的发展方向有新的理解；
3. 自主学习了canvas绘制图片、3D效果绘制模型、windows搭建wasm、rust、vscode开发环境、腾讯地图API学习、D3的API学习、antv图形可视化引擎API学习、书本《重构第二版》、Vue源码解析课程，在提升技术知识的过程中，也让我有更多的思考；
4. 去青海银行部署是一个很好的机会，







