
精通Vue、Vue Route、Vuex 开发框架
精通TypeScript编程语言
熟练使用css，less预编译语言
熟悉2D图形开发
撑握WebAssembly原理和开发方式

精通Canvas 2/3D编程，能运用Canvas API 绘制及处理普通位图和矢量图。
熟练掌握报表函数、能够开发出兼容office常规函数公式。
熟练掌握tsx开发模式


晚上需要了解的模块：
1.报表平台所有报表 已解决
2.精准营销3期  已解决
3.登陆加密相关  已解决
4.wasm的加密如何编写 
5.决策流的代码  已解决
6.君智新加的报表 已解决
7.大屏的展厅数据 已解决


2021-01
/////////////////////////////////////////////////////////////////////////////
1.1月22日完成微信分享流程、微信分享API的学习
2.根据培梁的cleanup代码提交记录，学习代码规范

在君智项目问卷分享中实际运用，在君智代码中执行代码规范。
中式报表
1.中式报表2期风控提出问题的跟进和修改。
2.中式报表2期风控提出迭代需求讨论、时间评估、版本迭代规划。
3.中控需求v1.0：完成返回按钮的交互修改。
4.中控需求v1.0：完成单元格过滤弹框的页面开发。
君智问卷调查开发
1.按时完成君智【问卷设计拖拽，修改、新增、删除】【问卷逻辑跳转】【问卷预览公共组件】【复制问卷弹框】页面的开发。
2.按时完成【问卷设计】、【问卷逻辑跳转】、【问卷发布】、【复制问卷】的接口联调。
3.按时完成【问卷设计】、【问卷逻辑跳转】、【问卷发布】、【问卷预览】的自测、代码优化。
4.按时完成【问卷模块】的提测。
5.主动完成【问卷列表】、【问卷数据简报】、【问卷数据明细】、【问卷答案回显】、【问卷浏览量】、【问卷分享配置】、【预览界面免登陆】的接口联调和收尾工作。
6.主动完成【问卷模块】、【数据简报】、【BI数据集】、【BI数据源】、【System项目管理】的交叉测试、自测。
7.主动参加组内人员代码的review，并给出优化建议。
8.配合测试修改已提测模块的bug，当日bug当日修复。

上月评价跟进：技术的提升：根据代码的review记录，提升代码质量，简洁，可读性。

* 本月考核总结：
开发前需求分析很重要：画流程图、确定实现方式、确定开发时间节点，对整个项目的推进有着很大的帮助，这些前期准备工作决定了能否按时提测并有足够时间自测。
* 展望：
部门项目流程逐步规范，期待君智的第一个版本。

2021-02
/////////////////////////////////////////////////////////////////////////////

1.对uni-app的了解
2.学习代码规范，做代码的review

对跨终端技术uni-app的学习；根据代码规范对君智负责模块做代码的优化。

中式报表二期功能开发
1.中控需求v1.0：按时完成单元格过滤弹框的接口联调，对各种场景的自测。
2.中控需求v1.0：按时完成单元格过滤、条件属性在单元格中添加标识。
3.中控需求v1.0：看板预览加快捷查看下一个看板的入口，接口联调，自测。
4.中控需求v1.0：完成仪表板添加文件夹功能的交叉测试。
5.中式报表v2.0：迭代需求讨论、时间评估、版本迭代规划，流程梳理，流程图输出。
6.中式报表v2.0：报表预警功能的开发，接口联调。
7.中式报表v2.0：图表设计右侧加数据和字段面板，sql数据集右侧加表字段展示交叉测试。
8.中式报表预览接口代码的优化，大量数据加载速度的提升，比优化前提升了5倍。
9.主动将中式报表的常见的，常反馈的用户体验问题修复了3个。
10.输出报表平台的部署文档，运维文档，常见问题文档，为报表平台的部署做好准备。

君智问卷调查开发
1.配合测试修复君智的bug，当天bug当前修复。
2.完成君智负责模块的UI还原，配合UI修改用户体验的优化。
3.完成部分问卷微信分享的接口联调，后移交给组内同事。
4.配合产品完成君智修改需求的开发和产品优化。

配合华夏项目的bug修复
1.配合后端修复华夏项目决策流的bug，定位问题，并查出原因。
2.配合后端针对bug修复的接口联调。

对君智负责模块进行代码的优化；对跨终端技术uni-app的了解

提示加载速度是前端常见的优化问题，借助chrome的Performance工具去定位问题，再逐步找出加载慢的原因，对症解决问题。
* 展望：
解决方案需要有数据支持，数据需要有所依据--解决方案需要实际的数据论证。

2021-03
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.3月3日完成在linux环境下非root用户安装nginx的学习
2.3月18日完成单元格函数计算方式的学习
3.3月22日完成报表平台图表单元格函数计算的学习

中式报表 
1.中式报表v2.0：报表预警短信功能的接口联调，定时任务调用的自测
2.中式报表v2.0：字段变量在中式报表预览、仪表板预览的兼容开发，影响范围的自测
3.中式报表v2.0：所有功能按照测试用例进行全范围的自测
4.中式报表v2.0：第二版本交付给风控同事，并配合操作解答
5.中式报表v2.0：第二版本提测，配合测试进行bug修复
6.主动将中式报表已开发的第一、二版的代码、插件bug、对用户体验进行了代码的重构和优化
7.中式报表v3.0：和后端、风控同事讨论中式报表第三版本对需求和实现方式
8.中式报表v3.0：完成单元格插入数据集弹框改版，文案可自定义左父、上父格
9.中式报表v3.0：进入单元格函数计算的开发 

青海银行--风险监测平台
1.风险监测平台第一个版本部署对前期准备工作：部署文档、需求评审文档、部署安装包
2.出差青海银行：部署中式报表第一版本的前端、输出最新的部署文档、配合青海银行同事验收
3.出差青海银行：讲解中式报表第一版本的需求评审、讲解中式报表的使用
4.出差青海银行：对部署完的中式报表进行线上验证，并添加案例
5.远程解答青海同事使用中式报表时遇到的问题，并跟进后端问题的解决

华夏银行
1.元数据管理编辑弹框错误提示信息的修复 
2.视图数据集数据筛选‘没值’回显问题修复
3.发布管理弹框关闭bug修复

精准营销3期
1.报表平台的仪表板、客户视图个人画像的统一风格UI样式修改
2.客群列表的UI样式调整，新增‘决策流客群’类型，开发详情页面
3.决策流新增6个节点、2个修改节点的接口联调
4.测试记录页面的开发，接口联调 （完成部分，后移交给前端同事）
5.主动将精准营销3期所有需求进行交叉测试，并向产品、前端同事提出优化建议


技术提升：
看完【重构第二版】1-6章

总结：
1.虚心接纳不同的建议，这能激发一些新的思考，使我们成长。
2.不同的人对产品的理解不同，客户抛出的问题有他们的考虑，所以前端还需要了解更多，了解整个系统包括后端，了解产品，用我们的专业知识为他们解答。

展望：
认真和细致可避免一些问题。

/////////////////////////////////////////////////////////////////////////////

山西： 太原、临汾、原平、大同、晋中、榆次
天津、苏州、上海、重庆、香港、长沙
陕西：西安 
山东： 日照、青岛、泰安
广东： 深圳、惠州、广州、河源、清远、湛江
海南：海口、三亚
广西： 贺州、梧州、桂林、南宁
西藏：拉萨、纳木错、日喀则
青海：西宁 
重庆：成都

下次去： 厦门、珠海、杭州、大连、哈尔滨、新疆、内蒙古


select * from work_hours WHERE emp_name = '马湘萍' and month = '04' order by dt desc


2021-04
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.4月1日完成大屏客户视图3D效果编写的学习
2.4月25日完成canvas绘制普通图片的学习

在大屏和可视化决策两个项目中使用和维护

中式报表 
1.中式报表v3.0：完成单元格函数计算的开发和接口联调
2.中式报表v3.0：完成第三版本的需求自测，配合测试进行bug修复
3.中式报表v3.0：部署第三版开发环境，并完成代码优化
4.手机号验证码登陆的自测，并提出相关优化建议
5.中式报表图表设计，左侧数据集字段可拖拽、可双击添加单元格数据集
6.主动优化和修复中式报表的用户体验10个
7.完成中式报表代码到主干分支的合并，并自测通过所有功能

青海银行--风险监测平台
1.青海银行中式报表第二版本部署包准备，发给机构组同事
2.青海银行中式报表第三版本部署包准备，安装步骤整理

精准营销3期
1.决策流--预定执行节点修改表时要清空对应的节点的开发
2.完成部分决策流、客群列表、报表平台的bug修复、样式修改
3.sql数据集修改后对应的图表数据不正确bug修复 （君智，精准营销都已修复）
4.精准营销3期配合后端添加【定时任务】界面

大屏 
1.大屏定时检查数据展示是否正常--热力图日概览无数据（后端已修复）
2.大屏的登陆接口、加密方式升级，并验证发到展厅
3.大屏综合管理的新闻接口对接，样式调整

君智 
1.系统管理角色描述改成200字符，不做特殊字符校验
2 仪表板只有在编辑或者客户视图-个人画像的预览才需要获取数据集列表

文档 
1.公共部署文档的补充和修改
2.完成《中式报表的使用手册》的编写
3.华夏银行前端运维文档补充，为系统运维培训做准备

技术提升：
看完【重构第二版】7-8章

总结：
多了解除自己负责模块的其他需求的实现代码、实现思路，为后期维护做好准备。

展望：
在完成代码测试并确信已了解代码功能之前,要对已编译的代码保持谨慎的态度。

/////////////////////////////////////////////////////////////////////////////


2021-05
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.5月14日完成GPU图形处理器、CPU中央处理器的了解
2.5月17日完成fusioncharts图表下钻的学习

在大屏视频加载中优化、在报表平台图表下钻功能中使用

中式报表 
1.优化功能v4.0： 完成预览界面筛选框回显默认值
2.优化功能v4.0：完成 图表设计界面可设置字段格式
3.完成中式报表合并到主干分支后提测，配合测试进行bug修复
4.完成中式报表XSpreadSheet插件转成ts文件，并自测所有功能

青海银行--风险监测平台
1.青海资产检测平台系统《管理中心用户操作文档》的整理，发给机构组同事
2.青海资产检测平台第四版本部署包打包，发给机构组同事
3.青海资产检测平台更新《中式报表的使用手册》

精准营销3期
1.完成报表平台、客户视图数据源列表默认取出所有数据源
2.完成客户视图的数据和报表平台的数据请求路径做区分
3.完成活动详情：活动执行详情中决策流数据取当时执行的决策流节点数据
4.精准营销3期的bug修复

飞算驾驶舱 
1.定期跟进飞算驾驶舱数据的正确性
2.首屏：完成分屏页面视频替换，图片替换 
3.讲解图片：完成添加讲解图片，并能在ipad控制在每个页面都可以打开
4.完成展厅视频加载优化和调试

君智 
1.完成问卷分享功能公众号appId从接口获取，接口联调
2.完成君智项目全局修改：登陆icon,页面logo的做区分,项目名称的修改
3.君智数据补录、爬虫任务功能的了解，时间的评估
4.君智爬虫任务：完成采集模版添加任务管理，自动创建数据集，任务爬取数据展示页面的开发
5.君智爬虫任务：完成采集模版任务管理的接口联调
6.君智数据补录：完成数据补录列表、记录、数据预览页面的开发


技术提升：
对于大数据量页面加载优化方案的学习

总结：
遇到问题：在大屏的分屏页面需要加载大量的数据(将近100M)：2个3D动画效果、6个页面的渲染、1分钟视频的加载，这种情况下页面加载视频、播放视频都有卡顿，任务管理器中GPU都能达到100%
定位问题：通过任务管理器可查看到视频卡顿时GPU能达到100%， CPU能到95%以上，由此可见3D模型的运转需要利用大部分的处理器进程，此时再加载视频处理器爆满就会卡顿
优化方案：视频加载、播放与页面加载分开进行，视频播放完再加载页面，加载完页面才会运转3D模型

展望：
优化页面方案其实不止一种，在用户体验、产品需求、技术实现、硬件配置等方面需要互相取舍，取最适合当下的最优方案。

/////////////////////////////////////////////////////////////////////////////
https://juejin.cn/post/6844904157950771208
https://github.com/ckken/ts-wasm









主要工作内容： 
1.精准营销三期开发、提测、bug修复 （活动列表改版、决策流改版、增加活动报表、客户分层、规则树改版）
2.中式报表第二版开发、提测、bug修复 （预警、字段变量、复制图表、图表设计改版）
3.中式报表第三版开发、提测、bug修复 （单元格函数计算、数据集弹框改版、仪表板故事版加文件夹管理）
4.中式报表第四版的开发、提测、bug修复 （手机号登陆、用户部门可选、拖拽数据集字段）
5.青海银行资产监测平台客户现场部署
6.华夏大屏开发、提测、客户现场部署上线
7.飞算大屏整改 （登陆改版、视频修改、讲解图片、体验优化）
8.中式报表迁移到主干分支、js插件改版成typescript、提测
9.君智一期的维护、bug修复，需求调整的开发、提测
10.君智优化版的开发、提测、bug修复 （数据补录、采集模版任务管理）
11.公共组件开发  （图片上传、图片裁剪，规则树，表格列表）





主要工作内容： 
1.精准营销三期开发（活动列表改版、决策流改版、增加活动报表、客户分层、规则树改版）
2.中式报表第二版开发（预警、字段变量、复制图表、图表设计改版）
3.中式报表第三版开发（单元格函数计算、数据集弹框改版、仪表板故事版加文件夹管理）
4.中式报表第四版开发（手机号登陆、用户部门可选、拖拽数据集字段）
5.青海银行资产监测平台客户现场部署
6.华夏大屏开发、提测、客户现场部署上线
7.飞算大屏整改 （登陆改版、视频修改、讲解图片、体验优化）
8.中式报表迁移到主干分支、js插件改版成typescript、提测
9.君智一期的维护、bug修复，需求调整的开发、提测
10.君智优化版开发（数据补录、采集模版任务管理）
11.公共组件开发 （图片上传、图片裁剪，规则树，表格列表）






君智框架的研发，技术性的调整，技术的选型，微信分享对接，接口加密、二维码插件、



2021-06
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
学习windows搭建wasm、rust、vscode开发环境的步骤

熟悉wasm的开发方式，为wasm的开发做准备

中式报表 
1.完成筛选条件文案功能迁移到右侧面板，bug修复
2.更新《中式报表用户使用手册》

青海银行--风险监测平台
1.第4.2版本部署包打包（短信登陆）发给机构组同事

华夏驾驶舱
1.综合看板几个图表的时间加上年份-月份
2.华夏部署驾驶舱：代码整理，部署包准备，去华夏部署
3.华夏最新源代码整理，开发环境软件准备，资料准备

飞算驾驶舱 
1.首页新闻动画，取最近时间前三条进行滚动
2.页面的所有logo换成飞算，logo添加点击隐藏展开菜单
3.仿真实验室：大屏首页数据调整的开发，发给裔文
4.大屏数据维护：定期检查数据显示是否正常

君智 
1.君智数据补录：完成数据补录列表、记录、数据预览接口的联调
2.问卷编辑：数据源默认选中，存储信息、字段中英文添加提示
3.问卷新建：手机、邮箱问卷题目开发
4.君智优化版新增、修改需求的开发，自测
5.君智优化版需求提测，配合测试进行bug修复
6.公共表格组件抽取，代码的优化，代码的review
7.君智报表：情感分析、词云图表的演示

技术提升：
对2D图表的漏斗图，金字塔图的配置进行学习

总结：
对辅助技能进行学习：UI的审美，产品需求的设计，数据库sql工具的使用，常用sql语句学习，运维部署的了解

展望：
完善自身的辅助技能可减少沟通时间，有助于团队之间合作，理解需求达成一致

/////////////////////////////////////////////////////////////////////////////




2021-07
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.腾讯地图API学习：定位，搜索，标注等功能
2.D3的API学习：svg线条绘制，节点拖拽，画布缩放拖拽等功能

1.在君智项目中使用腾讯地图定位
2.知识pad流程图使用D3相关功能

华夏项目
1.出差华夏进行精准营销、驾驶舱源码部署
2.给华夏相关交接人员讲解项目的启动，源码的开发流程

君智 
1.完成君智优化版本的bug修复
2.完成词云图表二次渲染问题修复，页面渲染速度提升2倍
3.完成君智数据补录重构：需求了解，任务分配，时间评估
4.完成君智数据补录：新建、文件导入页面开发，接口联调
5.完成君智数据补录：新建、文件导入自测，提测，bug修复，不同浏览器的兼容开发
6.完成图表设计：维度添加‘数值格式’设置，并对相关的图表预览界面调整
7.腾讯地图：API引入，开发定位、地址解析、覆盖物等功能
8.知识PAD插件开发：D3的引入，类型声明，svg图形功能开发
9.君智一期的需求了解、参加需求评审，时间评估

精准营销3期线上部署
1.完成线上部署包准备，部署文档整理，上线部署
2.完成精准营销3期的bug修复并部署 


技术提升：
词云2D图表配置学习，优化词云加载速度

总结：
插件的开发的重要第一步就是技术选型，这个过程需要尽可能多的收集相关成熟插件，参考他们的使用技术，实现功能，并考虑可扩展等方面

展望：
希望接下来开发出流畅的好用的知识PAD插件

/////////////////////////////////////////////////////////////////////////////



2021-08
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.D3的svg线条绘制、path形状绘制学习
2.微信小程序的API、开发流程了解

1.知识PAD流程图使用D3相关功能
2.君智微信小程序相关功能了解

君智1.2版本
1.君智优化版bug修复：公共表格的表头样式调整、体验优化、问卷防止重复提交
2.君智1.2开发前期准备工作：代码合并、需求了解、UI了解、插件选型
3.参加君智1.2版UI评审、1.2版需求评审；小程序的需求评审
4.完成君智知识PAD开发：新建、编辑、预览、分享弹框、分享预览页面开发
5.完成君智知识PAD接口联调: 知识PAD新建、编辑、预览、分享、数据来源
6.完成君智数据补录接口联调：上传文件、新建文件补录、文件转化
7.完成知识PAD插件画布相关功能开发：右键菜单、前进后退、缩放、拖拽画布、自适应、添加水印、导出图片、上传文件、上传图片、图片放大、文件下载
8.完成知识PAD插件节点相关功能开发：节点的新建编辑、节点的样式、拖拽节点、节点的展开收起
9.完成仪表板、故事版的分享弹框、分享流程改版
10.对公共组件的提取，合并代码的兼容测试

精准营销3期bug修复和上线
1.客户视图：编辑图表的接口前缀错误（已修复）
2.规则树：数据传值在特定场景下传输错误（已修复）

飞算驾驶舱
1.大屏展厅数据有部分图表无数据，已反馈给数据平台同事（已修复）。
2.定期检查飞算驾驶舱的运行情况、数据是否正确。

中式报表bug修复和自测
1.sql数据集：字段格式设置不生效 （已修复）
2.sql数据集：筛选变量,添加默认的格式化类型应统一为字符串类型（已修复）
3.sql数据集：筛选变量单元格只支持文本格式（已修复）

技术提升：
运用Canvas绘制及处理普通位图和矢量图、Svg处理dom操作更加熟练
总结：
1.如果不懂得使用规则和方法，像拆盲盒般的调试方法会消耗更多时间
2.对上线后的项目需要定期去查看运行情况，以确保数据正常
展望：
以提前完成任务为目标，预留更多时间来完善项目。

/////////////////////////////////////////////////////////////////////////////




2021-09
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.D3的dom操作、dom事件学习

1.知识PAD流程图使用D3操作dom事件

君智1.2版本
1.君智1.2修改需求的开发：分享流程的修改、知识PAD左侧数据源添加文件标签、知识PAD插入超链接
2.君智1.2页面开发：知识图谱搜索页面开发、知识图谱公共文章组件开发
3.君智1.2接口联调：知识pad接口联调收尾、知识图谱接口联调、文件补录转化接口联调
4.君智1.2需求评审：标签补录的需求评审、君智1.2测试用例评审
5.君智1.2自测：知识pad自测、知识图谱自测、舆情分析自测、文件补录自测、中式报表合并自测、分享流程自测
6.完成君智1.2的提测，配合测试修复bug
7.配合UI进行一些交互的确认和修复
8.参与产品需求的讨论，对一些交互提出优化建议
9.对知识PAD插件的交互进行优化

华夏大屏内部系统上线（经营指标大屏）
1.大屏5次需求更改9-09、9-13、9-14、9-15、9-17开发
2.配合大屏数据的接口联调，数据验证，上线配置

青海银行中式报表bug修复
1.前端需求更改：预警的短信模版ID去掉必填限制（已修改）
2.接口问题跟进：父级是分组的数据自身不能正常排序（已修复）

技术提升：
学习Vue源码解析第一章课程
总结：
1.对于多用户使用的操作，需要考虑到并发问题，规避风险。
2.对于一些可预判的风险提前暴露出来，及时调整可推进项目的进度。
展望：
项目的后期就是查缺补漏的过程，着重检查代码，提升代码质量。

/////////////////////////////////////////////////////////////////////////////


2021-10
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.学习浏览器滚动条的实现原理，xmind用户体验优化学习
2.10月28日参加李总和志峰分享的《数据中台建设》《机器学习介绍》的分享

1.知识PAD流程图加入虚拟滚动条，交互参考xmind，优化用户体验
2.对数据中台的建设和机器学习原理算法有初步的认识，了解大数据发展方向

君智1.2版本
1.君智1.2提测后配合测试修复bug
2.君智1.2新增需求的开发：
2.1 分享的简报的预览仪表板独立页面开发
2.2 君智项目添加下载帮助文档
2.3 知识pad数据源开发: 问卷报告，舆情分析，智能搜索，补录文件，分析报告
2.4 知识pad数据源拖拽图表生成图片开发
2.5 知识pad本地上传与文件补录关联
3.知识pad的用户体验优化：节点拖到画布边缘自动移动画布；画布滚动条的添加；流程图图片放大交互修改
4.配合君智1.2版上预发布
5.君智问卷报表开发：君智问卷发布流程的修改；君智问卷图表组件开发，弹框开发；
6.君智代码的优化，公共组件抽取，代码的review


精准营销bug修复 
1 【客户视图】【个人画像图表】编辑个人画像图表时会报异常错误
2 【用户头像】无法成功上传用户头像
3 【精准营销】【决策流】复制节点后保存决策流会报错，修复nodeBoxId重复问题

技术提升：
学习Vue源码解析第2、3章课程
总结：
1.多尝试才知道好坏，技术实现也是这样。
2.多收取其他使用者的使用建议，从另外一个角度审视自己的作品，会有新的感悟并去优化。
展望：
将自身的技术水平再往深度挖掘

/////////////////////////////////////////////////////////////////////////////



2021-11
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.学习JavaScript侦测手机浏览器的几种方法，识别打开网页的来源、设备型号
2.对vue源码的学习，对内部实现原理的了解

1.在君智问卷答题界面，支持对不同的设备进行统计，并对不同的设备有不同的限制
2.有助于在开发过程中定位问题，快速解决问题，避免错误的写法。

君智1.2.1版本、1.3版本开发
1.君智1.2.1问卷报表开发、接口联调、自测、bug修复
1.1 完成默认报告的接口联调和自测
1.2 完成默认报告的分享页面开发
1.3 完成问卷报表兼容性修改：问卷答题、简报版数据源生成图片、问卷发布的兼容性修改
1.4 完成君智1.2.1版本提测和bug修复
2.参加君智1.3版本问卷设计原型评审，问卷设计需求梳理，时间节点评估，输出开发计划，参与后端的数据模型定义
3.君智1.3版本问卷设计的开发、接口联调、自测、bug修复
3.1 完成问卷设计公共组件开发
3.2 完成问卷设计问卷编辑、问卷预览、问卷答题、电子问卷发布页面开发、接口联调
3.2 完成电子问卷整个流程的自测、交叉测试、按时提测
4.知识PAD优化：裁剪图片，复制粘贴图片到知识pad节点
5.君智企业色修改：全局配色文件添加，批量修改君智样式
6.君智代码的优化，公共组件抽取，代码的review


青海资产监测平台安全维护
1. 风险监测平台部分敏感信息接口加密：加密接口联调，自测，提测
2. 数据源-测试连接，失败后提示bug修复
3. 系统管理-用户管理列表添加一列手机号


技术提升：
学习Vue源码解析第4-8章课程
总结：
1.对公共组件，公共元素的抽取，有助于在有限时间内完成更多开发任务
2.制定开发计划，有条不紊的按计划实施，可以提高开发效率
展望：
将自身的技术水平再往深度挖掘

/////////////////////////////////////////////////////////////////////////////




2021-12
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.参加锦平、培梁主讲的全球架构师峰会的知识分享
2.对antv图形可视化引擎插件的API学习，学习复杂关系图形的绘制、布局、分析、交互、动画等图表可视化

1.参加峰会的分享对服务端的多种运行方式有所了解，对新技术，前端技术的发展方向有新的理解
2.antv在君智关系图谱中使用，让关系变得透明，简单

君智1.3版本开发
1.君智1.3问卷分析报表开发、联调测试、交叉测试
    1.1 完成查看下载答卷页面开发和自测；
    1.2 完成电话问卷默认报表、电话调研统计页面开发和自测；
    1.3 完成新增题型报表开发：矩阵填空、多项填空的数据报表开发和自测；
    1.4 完成消息列表的开发，websocket消息推送的接口联调和自测；
    1.5 完成电话问卷的交叉测试和提测；
2.对君智1.3已提测模块配合测试解决问题
    2.1 已提测的电子问卷联调测试，解决问题，优化交互；
    2.2 已提测的电话问卷联调测试，解决问题，优化交互；
3.主动完成君智问卷提交的交互优化
    3.1 编辑问卷的提示优化：页面定位到错误题目，定位到错误项，并给出对应的文字提示；
    3.2 问卷答题界面的提示优化：自动定位到不符合规则的题目并标红、给出友好文字提示，切换上一页下一页加上验证并给对应提示；
4.完成采集模版模块交互修改，接口联调
5.配合后端联调测试，修改对应的接口传参，修改接口定义类型
6.君智1.3智能搜索-关系图谱模块引用新插件antv-g6
    6.1 完成股权穿透图开发；
    6.2 完成股权穿透图-企业详情图表开发；
    6.3 完成企业关系图表开发；
7.持续对君智代码的优化，公共组件抽取，代码的review

项目相关：
1.更新项目中公共模块、公共混入的技术文档
2.配合培梁将前端依赖包整体升级，对开发环境、测试环境jenkins依赖包升级更新，更新后并验证通过

1.更新项目中公共模块、公共混入的技术文档，方便后期维护
2.项目依赖升级方便引入新特性，消除安全隐患。

技术提升：
学习Vue源码解析第9-10章课程
总结：
1.对源码的学习有助于在开发过程中使用最优方法，减少页面的渲染，优化渲染速度。
2.新的图形引擎有助于更多图形的定制化，将复杂关系变成透明，简单。对现有的图形解决方案提供更多可能。

展望：
熟练掌握antv开发图表，以便后期的图形可视化工具迭代升级

/////////////////////////////////////////////////////////////////////////////


工时填报系统
http://10.8.113.12/#/workbench
168	WB201910219029@feisuan	123456	SZ00012	马湘萍	数智科技部>前端开发


2022-01
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.1-18参加泽清、婷婷主讲的《项目管理》《测试流程》的知识分享

1.参加项目管理流程的分享有助于我们在项目进行过程中达成共识，了解项目的周期和相关节点。
2.参加测试流程的分享有助于我们了解测试的方法和区别，对SIT, UAT引起重视。

君智1.3版本开发
1.君智1.3智能搜索-【关系图谱】模块开发和接口联调
    1.1 完成人物关系图开发和接口联调；
    1.2 完成股权穿透图-企业详情的接口联调；
    1.3 完成关系图谱模块的筛选弹框开发，图表工具栏添加，接口联调；
    1.4 完成关系图谱模块的自测和提测；
2.配合君智【问卷模块】上UAT预发布环境
    2.1 修复电子问卷、电话问卷禅道上的问题；
    2.2 修复问卷分析报告的的问题；
    2.3 完成简报版-数据源-问卷报告-图表生成图片功能开发；
3.君智1.3智能搜索-【公共媒体】线条连线
    3.1 对有映射关系的文章和对应的属性用虚线、实线的连线；
    3.2 连线的动画添加，并自测多种场景；
    3.3 完成公共媒体的自测和提测；
4.君智1.3【舆情监测】模块开发和接口联调
    4.1 配合后端准备舆情对接的前期数据
    4.2 舆情概览主体页面框架开发，公共模块抽取
    4.3 完成舆情概览、广告详情页面开发和接口联调
5.对君智项目代码的优化，公共代码的抽取
	
青海资产检测平台
1.完成中式报表预览开发导出excel的功能，引入插件xlsx
2.完成导出excel功能的自测和提测
3.配合测试解决中式报表问题

技术提升：
学习Vue源码解析第11-12章课程
总结：
1. 利他就是最好的利己，在配合的过程中多为他人考虑其实最大程度上是利于自己的工作推展。
2. 换一种思路去思考，也许会发现一些偶现问题可以用另外的方式解决。

展望：
自己就是自己的项目，严格要求自己就是严格要求项目的质量

/////////////////////////////////////////////////////////////////////////////



2022-02
/////////////////////////////////////////////////////////////////////////////
核心技能提升：
1.websocket消息推送心跳监测方法学习
2.antv图形插件g6关系图谱API的学习

1.在君智项目中保持websocket连接，确保数据的时效性
2.在君智项目中【关系图谱】中使用，使企业、人物层级关系更加清晰

君智1.3版本开发
1.君智1.3【舆情监测】模块开发和接口联调、问题修复
    1.1 完成知识Pad数据源【舆情报告】图表生成图片，接口联调
    1.2 完成舆情监测websocket请求优化，切换tab重新连接websocket，token过期重新连接，保证websocket正常连接
    1.3 完成舆情监测模块配合测试修复问题，配合接口修改入参
2.君智1.3【智能搜索】关系图谱优化
	2.1 完成关系图谱的图表交互优化，线条交互修改，参考天眼查企业关系图表交互
	2.2 完成股权穿透图、关系图谱工具栏添加图片
	2.3 人物图片无法加载、人物图片跨域问题解决，添加人物节点默认样式
	2.4 图表的loading效果优化
3.君智UAT的功能自测，并修复相关问题，提出相关优化建议
4.君智1.3.1优化版需求开发、自测、问题修复
	4.1 【问卷设计】添加省市区、省市两种题型，接口联调
	4.2 【问卷设计】单选题、多选题添加图片上传，图片裁剪
	4.3 【问卷设计】分页栏批量删除，只删除分页，不删除问题
	4.3 【问卷设计】批量添加题目添加调研目的和调研对象筛选，同问卷模板
5.君智反馈问题修复：【测试问题反馈-20220224.xlsx】
6.对君智项目代码的优化，树形文件夹公共组件抽取

文档的输出
1.系统上线版本管理采用标签管理，版本发布之后，为代码打上标签，方便后期管理
2.输出标签管理说明、使用说明，规则说明文档

技术提升：
LeetCode简单算法学习
总结：
1. 完善一些边界性问题会使程序更加健壮
2. 程序中需要在每一个可能发生错误的地方捕获异常，这对错误的判断，错误的定位有很大的帮助，增加程序的稳定性

展望：
将自身的技术水平再往深度挖掘

/////////////////////////////////////////////////////////////////////////////

2022-03
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1.精准营销前期准备
2.可一键切换企业色
3.完成精准营销相关决策流节点开发，活动提升看板开发
4.完成精准营销产品当前BUG修复

预期成果
1.完成精准营销产品开发的前期准备：需求了解，原型评审，新分支创建，测试用例评审；
2.完成企业色调整，图片、图标和项目主调色根据企业色配置做区分，可一键切换企业色；
3.按时完成决策流预定执行节点、客户筛选节点、营销事件节点、A/B测试节点的前端开发和配合后端接口联调；
4.按时完成活动提升看板的前端开发和配合后端接口联调；
5.按时完成精准营销产品相关模块的自测，交叉自测和提测；
6.配合测试修复精准营销产品提测模块的问题；
7.配合产品对修改需求的调整，并提出优化建议；

成果说明
1.按照开发计划保质保量完成研发工作并按时提测；
2.及时修复问题，做到当天问题当天修复；
3.3月31号通过测试验收；

君智二期
行动计划 
1.根据最终用户使用后反馈，优化系统功能，主要包括:舆情监控、智能搜索、问卷调研等多个应用

预期成果
1、和产品、后端、测试、前端小组沟通确认问题修复内容，并按计划修复问题
2、对相关内容自测并配合测试修复

成果说明
1、及时修复用户反馈问题
2、降低影响范围

技术提升：bpmn-js决策流插件学习：常用方法，常用模块API学习，为今后精准营销项目中决策流插件的替换和更新迭代做准备

本月工作总结：
主要工作是完成精准营销系统的部分优化开发，并按时交付。
总结的问题：
从用户反馈问题可以更多的了解用户的需求和关注点，更容易理解需求的目的，并反思实现过程中哪些地方可以提升用户体验。
展望：
多思考、多使用，参考业内优秀的插件和他们实现的方式，在实际项目开发中取长补短。

/////////////////////////////////////////////////////////////////////////////


2022-04
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1.精准营销UI还原
2.完成决策流活动画布部分节点优化
3.完成呼叫中心节点的模版管理开发

预期成果
1、完成精准营销产品优化的前期准备：需求了解，原型评审，生成开发计划
2、按时完成决策流客户分群节点、客户筛选节点、营销事件节点、A/B测试节点、呼叫中心节点的优化
3、按时完成呼叫中心节点的模版管理界面开发和配合后端接口联调
4、按时完成精准营销产品相关优化模块的自测


成果说明
1、修复UI还原，使产品界面美观和规范
2、按照开发计划保质保量完成精准营销优化研发工作

君智二期
行动计划 
1、君智代码review，无用文件无用代码删除并优化相关代码
2、根据用户使用后反馈，优化系统功能，添加问卷版本号管理
3、配合君智用户反馈问题优化版上线
4、参加君智线下问卷需求评审，评估时间，生成开发计划，新分支创建

预期成果
1、使君智代码整洁，规范
2、按时完成问卷版本号管理，并对相关影响范围评估和修改，自测并交叉自测通过
3、按时提测系统优化的修改，并配合测试修改相关问题，配合UI还原设计
4、按计划启动君智线下问卷模块的开发：查看下载答卷相关模块开发
5、君智【数据监控】、【服务监控】页面nginx配置修改，修改步骤整理

成果说明
1、代码的review方便后期的维护和扩展
2、及时修复用户反馈问题
3、按计划实施君智线下问卷模块开发
4、nginx配置更新，为后期上线和维护做充分准备

技术提升：gRPC了解，学习前后端接口的标准和规范；antv-x6的API学习，为后期简报版的插件替换做准备。

本月工作总结：
主要工作是完成君智系统的部分优化开发，并按时交付；完成精准营销系统部分优化开发；启动君智线下问卷模块的开发；
总结的问题：
微信分享配置不同的分享方式会偶尔不生效，原因是因为微信分享规则修改了，我们也需要关注微信规则更新或者其他相关API的更新，并及时同步到项目，同步给用户。
展望：
熟练掌握标签序列化和反序列化解析规则

/////////////////////////////////////////////////////////////////////////////



2022-05
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1.完成精准营销呼叫中心模版：接口联调，自测和提测
2.修复精准营销产品相关优化模块第一轮第二轮测试问题
3.参加精准营销6月底上线需求评审

预期成果
1、按时完成精准营销产品相关优化模块的提测
2、按时完成精准营销产品相关优化模块的问题修复并清零
3、了解精准营销优化版需求，并制定开发计划

成果说明
1、按计划完成精准营销产品相关优化模块的自测，提测，问题修复，达到可上线状态
2、制定下一步精准营销开发计划，为后续开发做充分准备

君智二期
行动计划 
1、君智线下问卷富文本编辑器开发，新功能插件的引入
2、君智电子问卷分析：交叉分析，自定义查询页面开发和接口联调
3、君智线下问卷默认报告，添加观点，查看下载答卷，查看答卷详情，原文答卷页面开发和接口联调
4、参加君智线下问卷测试用例评审
5、君智线下问卷调研报告：列表，编辑，预览，历史版本，分享页面的开发和接口联调

预期成果
1、使富文本编辑器满足君智需求：文本编辑、图片编辑、列表编辑、标题编辑、高亮词功能，搜索词功能，下划线、中华线、居中、居左、居右功能、文字颜色、修改字体、关联问卷问题，关联答卷文本
2、完成电子问卷分析页面开发，完成线下问卷的部分功能开发，自测并交叉测试通过提测
3、完成线下问卷调研报告的开发，并按时提测
4、配合测试修改相关问题，配合UI还原设计

成果说明
1、公共组件的抽取，公共代码的抽取，方便后期维护
2、按照开发计划保质保量完成君智线下问卷模块研发工作
3、完成富文本编辑器开发，使插件功能符合君智需求
4、按计划实施君智提测模块，君智整体提测时间无延迟

技术提升：OnlyOffice文档编辑API学习，多人办公流程学习

本月工作总结：
主要工作是完成君智系统的线下问卷部分模块开发，并按时交付；完成精准营销系统部分优化提测，并及时修复问题；
总结的问题：
1. 富文本编辑器的关联文案借鉴了HTML标签的交叉嵌套，节点的开关和闭合规则来解决交叉文案的关联
2. 有想法就付诸行动，试过才知道合不合适
展望：
学习企业微信群活码API和规则，投入精准营销开发

/////////////////////////////////////////////////////////////////////////////



2022-06
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1、精准营销6月底上线版本需求了解，AIModeler需求评审，测试用例评审
2、精准营销开发前期准备工作
3、完成精准营销6月底上线版本开发

预期成果
1、按时完成精准营销产品六月底上线需求的时间评估，开发计划，代码合并，提测节点预估
2、按时完成【社交营销】模块的群活码、个人活码、欢迎语、企业微信节点、企业微信渠道的开发，联调，自测，提测
3、按时完成【AI Moderler】模块的AIModeler节点、AIModeler管理页面、AIModeler详情页、混淆矩阵开发，联调，自测，提测
4、按时完成【BI】模块的快捷创建客群、跳转营销页面自动创建节点、新建活动流程修改开发，联调，自测，提测
5、按时完成精准营销产品六月底上线块的问题修复并清零
6、按时完成精准营销产品六月底上线块的UI还原

成果说明
1、按计划完成精准营销产品六月底上线版本模块的开发，达到可上线状态
2、按时完成产品补充需求的开发，并优化相关代码和交互
3、抽取多个公共组件，提升开发效率，提升代码复用率
4、按计划实施精准营销提测模块，精准营销提测时间无延迟

君智二期
行动计划 
1、君智6月2号上线需求开发
2、参加君智舆情模块需求评审
3、配合测试完成君智线下问卷、调研报告问题修复
4、富文本框编辑器交互优化，提示文字汉化

预期成果
1、按时完成6月2号上线需求开发：默认报告单选题添加填空内容、下载电子问卷二维码、跳转逻辑选项名称同步
2、按时完成6月24号上线需求开发：调研报告，线下问卷原文答卷、交叉分析、自定义查询
3、按时完成君智6月24号上线版本的问题修复并清零
4、配合君智线下问卷和调研报告上UAT

成果说明
1、按时完成君智6月2号、6月24号上线版本开发，达到可上线状态
2、完成富文本编辑器交互优化，使插件功能符合君智需求

技术提升：AIModeler模型工作原理学习，应用场景学习；企业微信群活码建群、加群配置学习；

本月工作总结：
主要工作是完成精准营销系统6月底上线版本开发，并及时修复问题；完成君智系统的调研报告模块开发，并按时交付；
总结的问题：
对于使用第三方数据模块或者应用，需要了解工作的内部原理，方便后期维护
展望：
富文本框插件补充开发文档，方便后期维护

/////////////////////////////////////////////////////////////////////////////


2022-07
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1、配合精准营销六月底开发版本上线
2、精准营销七月份需求了解，前期准备工作
3、进入精准营销需求开发工作

预期成果
1、配合六月底开发版本上线，nginx配置修改，代码加上标签版本管理
2、按时完成【综合配置】【事件管理】模块的开发，联调，自测
3、按时完成【开始节点】【目标客群节点】【Offer节点】模块的开发，联调，自测
4、按时完成【客户视图-新建客群】模块的开发，联调，自测
5、按时完成精准营销节点的梳理，公共规则组件开发

成果说明
1、按计划实施精准营销产品七月份需求模块的开发，客户规则筛选组件的开发
2、配合产品完成补充需求的开发，并优化相关代码和交互
3、抽取规则筛选公共组件，统一筛选规则，提升开发效率，提升代码复用率

君智二期
行动计划 
1、君智【舆情模块】部分功能开发，舆情图表下钻功能开发
2、君智UAT反馈问题修复，配合版本上线，规范代码版本管理
3、公共模块BI在多个项目代码兼容


预期成果
1、按时完成舆情模块多张图表下钻功能的开发，并自测通过，配合测试验证
2、按时完成7月19号上线需求开发，完成相关的交互优化
3、完成君智项目角色权限的需求了解，权限梳理
4、完成君智UAT反馈的0725问题时间评估，制定开发计划
5、富文本框编辑器小屏幕兼容优化，交互优化，性能优化

成果说明
1、配合完成君智7月19号舆情模块上线版本开发，达到可上线状态
2、富文本编辑器迭代优化，使插件功能符合君智需求
3、制定下一步君智问题修复计划，为后续开发做充分准备

技术提升：飞书文本编辑器交互学习，部分功能同步到君智项目富文本框编辑器

本月工作总结：
主要工作是按计划开始精准营销系统7、8月份版本开发；配合完成君智系统的舆情模块图表下钻开发，配合修复君智UAT客户反馈优化；
总结的问题：
明确需求才能顺利实施开发计划，只要发现有不明确不合理的地方都需要立即确认，再进入开发。
展望：
遇到问题多思考，给出专业的建议

/////////////////////////////////////////////////////////////////////////////



2022-08
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1、精准营销剩余3个节点需求开发工作
2、精准营销客户分层规则开发

预期成果
1、按时完成【目标客群】客群规则预览界面开发
2、按时完成【成功标准节点】【响应标准节点】模块的开发，联调，自测
3、按时完成【客户分层规则】模块的开发，联调，自测
4、进入【裂变节点】的页面开发，数据模型定义，添加相关验证

成果说明
1、按计划实施精准营销产品剩余节点的开发
2、完成公共组件【客户规则筛选组件】预览的兼容
3、完成客户分层规则开发，套用公共规则组件

君智二期
行动计划 
1、君智【0804版本】、【0818版本】、【0901版本】上线版本需求的开发
2、君智【0804版本】、【0818版本】上线跟进
3、君智【7_25反馈问题】、【文件补录】对接飞书、【调研访谈】、【热点事件】的原型需求评审以及时间评估
4、【君智图表主题色】影响页面梳理，时间评估


预期成果
1、配合【0804版本】号上线版本的跟进
2、按时完成【0818版本】上线版本部分需求开发，完成相关的交互修改，自测
   2.1、【默认报告】新增问卷版本、问卷问题、问卷调研信息筛选条件
   2.2、【电话问卷、线下调研】的问题默认为改为非必填（不勾选）
   2.3、【君智图表主题色】影响页面的修改和兼容
   2.4、【音频播放】控件交互方式修改：改为后端直接提供url的方式，只需在url上加token
   2.5、【默认报告】【查看下载答卷】新增动态字段筛选条件
3、按时完成【0901版本】上线版本部分需求开发，完成相关的交互修改，自测
   3.1、【默认报告】线下调研问卷默认报告题目新增追加问题分析功能
   3.2、【调研报告】【简报版】数据源的追加问题图表生成图片
   3.3、【问卷设计】新增题目或选项时需自动跳转到该题目或该选项的位置
   3.4、【问卷编辑】题目编辑交互变更
   3.5、【问卷设置】电话问卷、线下问卷发布工作流程修改
   3.6、【线下调研问卷】问卷作答页面填空题、追加问题文本框没有自适应高度
   3.7、【调研报告】自动保存交互修改、标题保存交互修改
4、完成【调研访谈】【热点事件】【文件补录】对接飞书时间评估，制定开发计划
5、自觉完成每周四上线版本的交叉自测

成果说明
1、按时完成君智【0804版本】、【0818版本】、【0901版本】上线需求开发，达到可上线状态
2、君智新需求的时间评估，制定开发计划，为后续开发做充分准备
3、逐步进行代码的CodeReview工作，使代码整洁干净，消除隐藏隐患

技术提升：飞书文件管理API学习；音频转码学习；

本月工作总结：
主要工作是按计划开发君智系统的每周四版本上线版本，参加君智新需求的需求评审和时间评估；配合完成精准营销系统剩余节点和客户分层开发；
总结的问题：
个别音频m4a后缀的在谷歌浏览器不能播放，找问题的过程中顺便了解了音频的相关历史，标准编码，转码的相关知识。
展望：
追求代码质量是一个成长的过程

/////////////////////////////////////////////////////////////////////////////


2022-09
/////////////////////////////////////////////////////////////////////////////
精准营销产品版本开发
行动计划
1、精准营销【吴晓波频道】需求的开始节点开发

预期成果
1、将精准营销4.1版本的开始节点的代码合并过来，使用精准营销4.1版本的开始节点的预定执行

成果说明
1、完成开始节点的代码迁移，支持【吴晓波频道】需求的决策流开发

君智二期
行动计划 
1、君智【0901版本】上线版本需求的提测，上线跟进
2、君智【0908版本】、【0922版本调研访谈】需求的开发，自测，提测，上线跟进
3、内部君智系统添加【滑块题型】需求的开发，自测，提测，上线跟进
4、进入君智【热点事件】需求的开发


预期成果
1、配合【0901版本】的问题修复和上线的跟进
2、按时完成【0908版本】上线版本部分需求开发，完成相关的交互修改，自测
   2.1、【问卷编辑】编辑问卷问题时，用户无需先删除默认标题，再输入自己的问题
   2.2、【电子问卷、电话问卷、线下调研】三大问卷类型拆分
   2.3、【默认报告】词云下载图片颜色修改，观点和追加问题的词云放大和缩小不起作用修复
   2.4、【文件上传】修改文件名称后显示异常修复
   2.5、【电子问卷、电话调研、线下调研问卷列表】复制增加指定调研方式
   2.6、【问卷编辑】问卷发布后再次编辑可以调整问题顺序
   2.7、【单选题、矩阵单选、量表题、矩阵量表】支持取消选择
3、按时完成【0922版本调研访谈】上线版本部分需求开发，完成相关的交互修改，自测
   3.1、【组合问卷】新建问卷、编辑问卷、预览问卷、电脑手机外观、组合问卷发布的开发
   3.2、【组合问卷】默认报告、查看下载答卷的开发
   3.3、【访谈记录】线下问卷作答页增加访谈记录，保存和修改接口联调
   3.4、【访谈记录】可伸缩模块，关联单份问卷问题，关联组合问卷问题，关联原文开发
   3.5、【组合问卷作答】再次编辑原文作答，没有回显之前已作答的内容修复
   3.6、【组合问卷作答】新增音频后导致重复新增问题修复
4、按时完成君智系统添加【滑块题型】需求的开发，自测，提测，上线跟进
5、自觉完成每个上线版本的交叉自测
6、进入【热点事件】需求开发，和接口对接数据模型

成果说明
1、按时完成君智【0901版本】、【0908版本】、【0922版本】、【滑块题型】上线需求开发，达到可上线状态
2、对接【热点事件】数据模型，为后续开发做充分准备
3、积极配合测试进行UAT验证，快速修复问题

技术提升：Vue3语法学习；

本月工作总结：
主要工作是按计划开发君智系统的周四版本上线版本，支持君智新需求的开发和上线；配合完成精准营销系统【吴晓波频道】需求的开发；
总结的问题：
有些时候需要别人的督促才会意识到问题，在体验产品上多听听别人的建议
展望：
熟练使用Vue3开发语法和模式

/////////////////////////////////////////////////////////////////////////////

2022-10
/////////////////////////////////////////////////////////////////////////////

君智二期
行动计划 
1、君智【热点事件】需求的开发，自测，提测，上线跟进
2、君智【1021版本】、【1028版本】需求的开发，自测，提测，上线跟进

预期成果
1、配合【1021版本】的问题修复和上线的跟进
  1.1、【问卷默认报告】默认报告选项列表滚动条去掉，自适应高度修复
  1.2、【问卷编辑】删除题目后题目的高度没更新，批量删除多层弹框的遮罩层修复
  1.3、【调研报告】数据源的表格样式问题调整
  1.4、【线下问卷】调研访谈高度偶现叠加问题修复
  1.5、【主题色】饼状图、柱状图主题颜色修改
2、按时完成【热点事件】上线版本部分需求开发，联调，提测，上线跟进
   2.1、【热搜事件列表】多个筛选条件、关注、不感兴趣、合并事件弹框、热度上升下降提示开发
   2.2、【事件预警】新增预警、编辑预警、预警消息通知，预警消息列表开发
   2.3、【热点事件信息列表】多个筛选条件、查看原文、关注事件开发
   2.4、【关注事件列表】多个筛选条件、热度上升下降提示、删除、查看事件报表
   2.5、【关注事件详情】整体概况6个图表、评论分析4个图表、微博画像4个图表、图表的下钻查看信息列表开发 
   2.6、【关注事件详情】配合UI修改图表样式
3、按时完成【1028版本】上线版本部分需求开发，提测，上线跟进
   3.1、【问卷编辑】计算公式的弹框开发，接口联调
   3.2、【问卷答卷】计算公式答卷逻辑处理
   3.3、【消息列表】配合后端修改传参
   3.4、【信息列表】信息列表处的评论应展示字段修改、文章标题过长UI修复
4、参加【热点事件】测试用例评审
5、完成每个上线版本的交叉自测

成果说明
1、按时完成君智【1021版本】、【1028版本】、【热点事件】上线需求开发，达到可上线状态
2、积极配合测试进行UAT验证，快速修复问题
3、配合UI对整体图表样式调整

技术提升：Vue3、tsx语法学习；

本月工作总结：
主要工作是按计划开发君智系统的周五版本上线版本，支持君智新需求的开发和上线
总结的问题：
了解项目构建流程，新的构建工具用法了解
展望：
熟练使用tsx开发页面

/////////////////////////////////////////////////////////////////////////////


2022-11
/////////////////////////////////////////////////////////////////////////////

君智二期
行动计划 
1、君智UAT问题修复，优化需求开发
2、君智【词云分析】原型评审，需求了解，时间评估，需求开发，自测，提测
3、君智【问卷调研问题反馈列表1215】【问卷调研问题反馈列表1223】原型评审、需求了解、时间评估
4、君智【问卷调研问题反馈列表1215】需求的开发，自测，部分需求提测

预期成果
1、配合君智UAT问题修复，优化需求开发
  1.1、【事件详情】传播路径图表画布大小调整，可上下滚动画布（新需求）
  1.2、【事件详情】评论总数图表下钻数据带‘评论’条件筛选
  1.3、【热点信息列表、热点详情图表】下钻数据的情感默认加上全部
  1.4、【事件详情】 热点信息默认时间改成三个月（新需求）
  1.5、【问卷设计】问卷标题变更为可输入特殊字符、不可输入英文单引号和正斜杠（新需求）
  1.6、【情感分析】切换渠道没有调用接口修复
  1.7、【问卷设计】从其他题型切换到多选题后，最少选几项和最多选几项没有填充内容修复
  1.8、【logo替换】君智启用新logo，系统中君智logo需要替换（新需求）
  1.9、【问卷列表】从发送问卷页面返回到问卷列表页面后，当前文件夹显示的问卷有误修复
2、按时完成【词云分析】部分需求开发，联调，部分需求提测
   2.1、【词云图表】设置字体，设置旋转角度，设置颜色主题，设置鼠标经过提示，点击图表下钻，图表大小修改
   2.2、【词云图表】设置词云图片的形状、获取缩略图、下载图片
   2.3、【词云图表】词云图表为可切换编辑状态，选中图表中的关键词可以放大、缩小、删除
   2.4、【词云设计】【关键词列表】关键词数量较多时，会拉长词云图表画布修复
   2.5、【词云设计】关键词超过一定长度后，在词云图表中展示省略号
3、进入【问卷调研问题反馈列表1215】上线版本部分需求开发，自测、提测
   3.1、【网页采集】加‘大众点评’渠道、支持省份城市的多选
   3.2、【查看下载答卷】答卷列表不同分辨率下高度自适应
   3.3、【问卷编辑】题目“问题”修改为标题、题目“完成编辑”修改为保存
   3.4、【问卷编辑】问卷发布后再次编辑显示“在此题之后插入新题”按钮
   3.5、【调研报告】问卷数据源-图表数据懒加载
   3.6、【默认报告】添加观点-观点的原文搜索和观点搜索做区分
   3.7、【默认报告】添加观点-筛选答案增加全选复选框、预设观点支持删除
   3.7、【交叉分析】统计图中百分比是0的值不用显示
4、参加【词云分析】【问卷调研问题反馈列表1215】【问卷调研问题反馈列表1223】原型评审
5、Antv-G2Plot图表库引入，升级君智项目词云图表、漏斗图表

成果说明
1、积极配合测试进行UAT验证，快速修复问题
2、按计划实施君智【词云分析】、【问卷调研问题反馈列表1215】上线需求开发和接口联调
3、配合UI对词云、漏斗图表样式调整
4、升级词云组件，贴合君智最新词云交互

技术提升：Antv-G2、Antv-G2Plot图表库语法学习；

本月工作总结：
主要工作是按计划开发君智系统的【词云分析】【问卷调研问题反馈列表1215】版本，支持君智新需求的开发，配合测试进行UAT验证
总结的问题：
Canvas画布的弧度路径绘制和Svg的弧度路径绘制有区别，但也有相似之处，知晓原理计算方式，就可按照参数绘制出预期的图形和图案。
展望：
熟练掌握Antv-g2plot开发图表，以便后期的BI图图表工具迭代升级
/////////////////////////////////////////////////////////////////////////////

2022-12
/////////////////////////////////////////////////////////////////////////////

君智二期
行动计划 
1、【君智1208版本】需求的开发、上线
2、君智【问卷调研问题反馈列表1215】剩余需求的开发，自测，需求提测、上线
3、君智【问卷调研问题反馈列表1223】需求的开发，自测，需求提测、上线
4、君智【词云分析】部分问题修复、上线
5、君智【预测预判】原型评审、需求开发

预期成果
1、【君智1208版本】开发、上线
   1.1、【网页采集】添加大众点评需求独立上线，拆分代码
   1.2、【观点图表】默认选中‘隐藏空/跳过的答卷’
2、【问卷调研问题反馈列表1215】上线版本剩余需求开发，自测、提测、上线
   2.1、【观点弹框】答卷列表筛选条件“答案文本修改为复选框”，增加全选
   2.2、【观点弹框】预设观点支持删除
   2.3、【交叉分析】统计图中百分比是0的不显示
   2.4、【问卷编辑】标题和提示文本框内容超过后自适应高度
   2.5、【默认报告】大数据量首屏加载速度提升，分批加载
   2.6、【问卷发布】新增题目版本
   2.7、【交叉分析】填空题有做观点统计的，该观点统计可放入交叉分析中分析
   2.7、【默认报告】将词云设置功能（编辑颜色、字体）添加在问卷自定义样式中
   2.8、【舆情信息】下钻图表数据配合后端修改
   2.9、【默认报告】【查看下载答卷】页面全局筛选条件修改
3、【词云分析】修复8个禅道问题、上线
4、【问卷调研问题反馈列表1223】需求的开发，自测，需求提测、上线
   4.1、【电话组合问卷】的添加
   4.2、【情感分析】高频词根据所选情感倾向返回正确的情感倾向的关键词 
   4.4、【调研统计】页面挪到电话发送页面，且放开权限控制
   4.5、【默认报告】柱状图、条形图、堆叠柱状图、堆叠条形图、折线图下载图片不全
5、【预测预判】原型评审、进入需求开发

成果说明
1、默认报告针对特定大数据量首屏加载速度提升8倍
2、按计划实施君智【君智1208版本】、【词云分析】、【问卷调研问题反馈列表1215】、【问卷调研问题反馈列表1223】上线需求开发和接口联调
3、配合君智各个版本上UAT，积极修复UAT问题
4、按计划实施君智预测预判需求开发

精准营销产品版本开发
行动计划
1、精准营销【中行权限】需求了解，需求开发，自测，提测

预期成果
1、按时完成精准营销【中行权限】需求开发、自测、提测 
  1.1、【角色管理】内容权限修改
  1.2、【营销活动】开始节点活动策划机构、活动策划人员权限范围修改
  1.3、【营销活动】AI模型节点预测目标概率修改
  1.4、【综合配置】新增【行级权限控制字段】
  1.5、【数据权限】修改后，关于树形部门管理结构的影响修复
2、配合测试修复已提测需求的问题修复
3、配合【中行权限】需求上演示环境

成果说明
1、完成【中行权限】所有新增修改需求的开发，达到可上线状态
2、积极配合修复演示环境问题，确保演示环境运行正常


技术提升：FusionCharts图表配置语法学习；

本月工作总结：
主要工作是按计划开发君智系统的【1208版本】【词云分析】【问卷调研问题反馈列表1215】【问卷调研问题反馈列表1223】版本，配合测试进行UAT验证；按计划完成精准营销【中行权限】需求的开发，配合上演示环境
总结的问题：
当暴露出的问题互相矛盾时，取最优解
展望：
继续保持对工作的热情
/////////////////////////////////////////////////////////////////////////////






